app/controllers/books_controller.rb

  def create
    @books = Book.all.order(created_at: :desc)
---
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC