app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC
---
  def index
    @books = Book.all.order(created_at: :desc)