app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
  def index
    @users = User.all.order(created_at: :desc)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? ORDER BY "books"."created_at" DESC  [["user_id", 8]]
---
  def show
    @user = User.find(params[:id])
    @book = Book.new
    @books = @user.books.order(created_at: :desc)